src/cf/Catalogs/QIWI_АдаптерНастройкиИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QIWI_АдаптерНастройкиИсходящихСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособФормированияСообщений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерСпособыПреобразованияСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаФормированияИсходящего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПроизвольногоОбработчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерВариантыПроизвольногоОбработчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроенногоОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФормированияСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОбработчикПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОбработчикПослеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбработчикаПриОтправке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерВариантыПроизвольногоОбработчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроенногоОбработчикаПриОтправке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПриОтправке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТранспортОбработчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаКонвертации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерфейсТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерИнтерфейсыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеПараметрыПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерПодключенияКВнешнимСистемам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СжиматьВZip</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбрабатыватьРезультатЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВходящегоДляОбработкиРезультата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерТипВходящегоСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/QIWI_АдаптерСпособыПреобразованияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>QIWI_АдаптерСпособыПреобразованияСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйАлгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонструкторСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилоКонвертации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/QIWI_АдаптерВариантыПроизвольногоОбработчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>QIWI_АдаптерВариантыПроизвольногоОбработчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстроенныйОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемыйОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяВнеПодсистемы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/QIWI_АдаптерНастройкиИсходящихСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СпособФормированияСообщенийПриИзмененииНаСервере();
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();
	ВариантОбработчикаПриОтправкеПриИзмененииНаСервере(); 
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СинхронныйРежимПриИзменении(Элемент)
	
	Если Объект.ИспользоватьОбработчикПослеОтправки Тогда
		ТекстВопроса = "Установлен признак """ + Элементы.ИспользоватьОбработчикПослеОтправки.Заголовок + """
		|он будет снят, т.к. он доступен только при асинхронном режиме. Продолжить?";
		Таймаут = 60;
		ОписаниеОповещения = Новый ОписаниеОповещения("СинхронныйРежимПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, Таймаут);
	Иначе
		СинхронныйРежимПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронныйРежимПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Объект.СинхронныйРежим = Ложь;
		Возврат;
	КонецЕсли;
	
	СинхронныйРежимПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СинхронныйРежимПриИзмененииНаСервере()
	
	Если Объект.СинхронныйРежим Тогда
		Объект.ИспользоватьОбработчикПослеОтправки = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьОбработчикПослеОтправкиПриИзменении(Элемент)
	ИспользоватьОбработчикПослеОтправкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОбработчикПослеОтправкиПриИзмененииНаСервере()
	
	Если Объект.ИспользоватьОбработчикПослеОтправки Тогда
		Объект.ОбрабатыватьРезультатЗапроса = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбрабатыватьРезультатЗапросаПриИзменении(Элемент)
	ОбрабатыватьРезультатЗапросаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбрабатыватьРезультатЗапросаПриИзмененииНаСервере()
	
	Если Объект.ОбрабатыватьРезультатЗапроса Тогда
		Объект.ИспользоватьОбработчикПослеОтправки = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ДоступностьПослеОтправки = Не Объект.СинхронныйРежим И Не Объект.ОбрабатыватьРезультатЗапроса;
	Элементы.ГруппаПослеОтправкиДанных.Доступность = ДоступностьПослеОтправки;
	
	ДоступностьОбрабатыватьРезультат = Не Объект.ИспользоватьОбработчикПослеОтправки;
	Элементы.ГруппаОбработкаОтвета.Доступность = ДоступностьОбрабатыватьРезультат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодФормированияИзШаблона(Команда)
		
	Объект.КодФормированияСообщения = ПолучитьТекстШаблонаКода();
	
КонецПроцедуры
		
&НаСервере
Функция ПолучитьТекстШаблонаКода()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекстШаблона = ТекущийОбъект.ПолучитьМакет("ШаблонКодаФормирования");
	
	Возврат ТекстШаблона.ПолучитьТекст();
	
КонецФункции	

&НаКлиенте
Процедура КодФормированияСообщенияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособФормированияСообщенийПриИзменении(Элемент)
	СпособФормированияСообщенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпособФормированияСообщенийПриИзмененииНаСервере()
	
	СпособФормированияСообщений = Объект.СпособФормированияСообщений;
	МассивСтраницСпособов = Новый Массив;
	МассивСтраницСпособов.Добавить("КонструкторСообщения");
	МассивСтраницСпособов.Добавить("ПроизвольныйАлгоритм");
	МассивСтраницСпособов.Добавить("ПравилоКонвертации");
	
	Для Каждого ИмяСтраницы Из МассивСтраницСпособов Цикл
		ВидимостьСтраницы = СпособФормированияСообщений = Перечисления.QIWI_АдаптерСпособыПреобразованияСообщений[ИмяСтраницы];
		Элементы["Страница" + ИмяСтраницы].Видимость = ВидимостьСтраницы;		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВариантПроизвольногоОбработчикаПриИзменении(Элемент)	
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВариантПроизвольногоОбработчикаПриИзмененииНаСервере()
	
	ВариантПроизвольногоОбработчика = Объект.ВариантПроизвольногоОбработчика;
	
	Элементы.ИмяВстроенногоОбработчика.Видимость = Ложь;
	Элементы.ОбработкаФормированияИсходящего.Видимость = Ложь;
	Элементы.ГруппаКодФормирования.Видимость = Ложь;
	Элементы.ИнфоВариантОбработчикаИной.Видимость = Ложь;
	
	Если ВариантПроизвольногоОбработчика = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ВстроенныйОбработчик Тогда
		Элементы.ИмяВстроенногоОбработчика.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик Тогда
		Элементы.ОбработкаФормированияИсходящего.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ПроизвольныйКод Тогда
		Элементы.ГруппаКодФормирования.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ОпределяетсяВнеПодсистемы Тогда
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина; 		
	Иначе
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработчикаПриОтправкеПриИзменении(Элемент)
	ВариантОбработчикаПриОтправкеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВариантОбработчикаПриОтправкеПриИзмененииНаСервере()
	
	ВариантОбработчикаПриОтправке = Объект.ВариантОбработчикаПриОтправке;
	
	Элементы.ИмяВстроенногоОбработчикаПриОтправке.Видимость = Ложь;
	Элементы.ОбработкаПриОтправке.Видимость = Ложь;
	Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Ложь;
	Элементы.ИнфоПередОтправкой.Видимость = Истина;
	
	Если ВариантОбработчикаПриОтправке = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ВстроенныйОбработчик Тогда
		Элементы.ИмяВстроенногоОбработчикаПриОтправке.Видимость = Истина;
	ИначеЕсли ВариантОбработчикаПриОтправке = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик Тогда
		Элементы.ОбработкаПриОтправке.Видимость = Истина; 
	ИначеЕсли ВариантОбработчикаПриОтправке = 
		Перечисления.QIWI_АдаптерВариантыПроизвольногоОбработчика.ОпределяетсяВнеПодсистемы Тогда
		Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Истина; 
		Элементы.ИнфоПередОтправкой.Видимость = Ложь;
	Иначе
		Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Истина;
		Элементы.ИнфоПередОтправкой.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработчикаПриОтправкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(
		ПредопределенноеЗначение("Перечисление.QIWI_АдаптерВариантыПроизвольногоОбработчика.ВстроенныйОбработчик"),
		"Встроенный обработчик"); 
	СписокЗначений.Добавить(
		ПредопределенноеЗначение("Перечисление.QIWI_АдаптерВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик"),
		"Подключаемый обработчик"); 
	
	ДанныеВыбора = СписокЗначений;

КонецПроцедуры
   
#КонецОбласти
